Revit 2023 API
MassZone Properties
The MassZone type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
ConditionType
 The gbXMLConditionType of the MassZone.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
CutByLowerLevel
 Indicates the relationship between the MassZone and its lower level.
CutByUpperLevel
 Indicates the relationship between the MassZone and its upper level.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
FloorArea
 The floor area of the MassZone.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsModifiable
 Identifies if the element is modifiable.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
IsZoneOccupiable
 A MassZone must have a level as its bottom to be occupiable; If it does not, it is still a MassZone, but it is not occupiable
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
LowerLevelId
 The bottom level defining the MassZone.
MassEnergyAnalyticalModelId
 The ElementId of the MassEnergyAnalyticalModel that the MassZone is derived from.
MaterialId
 The visualization material for the MassZone. Will be InvalidElementId if material is by category or the material type is by MassZoneMaterialTypeMaterialBySurfaceType.
MaterialType
 Indicates how the material of MassZone faces is determined.
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
SpaceType
 The gbXMLSpaceType of the MassZone.
SpaceTypeId
 The space type element of the MassZone.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpperLevelId
 The upper level defining the MassZone.
VersionGuid
 Get the element version Guid.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Volume
 The volume of the MassZone.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace